![png](ERD Books(Core).png)

# Create the Database

In [1]:
import pandas as pd
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

In [5]:
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
connection = "mysql+pymysql://root:Batman1996@localhost/books"

In [6]:
engine = create_engine(connection)

In [8]:
## Check if database exists, if not, create it
if database_exists(connection) == False: create_database(connection)
else: print('The database already exists.')

The database already exists.

In [11]:
users_df = pd.read_csv('/Users/sheelvohra/Downloads/users.csv')
users_df.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [12]:
users_df.to_sql('users', engine, if_exists = 'replace')

In [13]:
books_df = pd.read_csv('/Users/sheelvohra/Downloads/books.csv')
books_df.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [14]:
books_df.to_sql('books', engine, if_exists = 'replace')

In [15]:
authors_df = pd.read_csv('/Users/sheelvohra/Downloads/authors.csv')
authors_df.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [16]:
authors_df.to_sql('authors', engine, if_exists = 'replace')

In [17]:
favorites_df = pd.read_csv('/Users/sheelvohra/Downloads/favorites.csv')
favorites_df.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [18]:
favorites_df.to_sql('favorites', engine, if_exists = 'replace')

In [19]:
#testing tables
q = """
SHOW tables
;"""
pd.read_sql(q, engine)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

In [20]:
q = """
SELECT books.title, favorites.user_id
FROM books
JOIN favorites ON books.id = favorites.book_id
WHERE favorites.user_id = 
    (SELECT users.id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"))
;"""
pd.read_sql(q, engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1